tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'

# Packages:
brew 'zsh'
brew 'zsh-completions'
brew 'thefuck'
brew 'tmux'
brew 'wget'
brew 'travis'
brew 'task'
brew 'jenkins'
brew 'python'
brew 'python3'
brew 'jpeg'
brew 'htop'
brew 'tree'
brew 'telnet'
brew 'mysql'
brew 'go'
brew 'googler'
brew 'git'
brew 'gource'
brew 'opencv'
brew 'openssl'
brew 'nmap'
brew 'cmake'
brew 'cmatrix'
brew 'minikube'
brew 'docker'
brew 'docker-compose'
brew 'gnupg'
brew 'numpy'
brew 'hub'
brew 'neofetch'
brew 'cask'
brew 'bash-completion'
brew 'ruby'
brew 'kubernetes-cli'
brew 'flake8'
brew 'go'
brew 'dart'

# Casks:
cask 'discord'
cask 'virtualbox'
cask 'balenaetcher'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'gitkraken'
cask 'github'
cask 'visal-studio-code'
cask 'pycharm'
cask 'chrome'
cask 'alfred'
cask 'zoom'
cask 'wireshark'
cask 'opera'
