tap "antoniott15/fgf"
tap "dart-lang/dart"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "sambadevi/powerlevel9k"
cask "xquartz"
brew "ansible"
brew "bash-completion"
brew "libpng"
brew "python"
brew "cask"
brew "cmake"
brew "eigen"
brew "cmatrix"
brew "cowsay"
brew "dive"
brew "docker", link: false
brew "docker-compose", link: false
brew "exiftool"
brew "jpeg"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "fish"
brew "fortune"
brew "git", link: false
brew "gnupg", link: false
brew "go"
brew "googler"
brew "gource"
brew "htop"
brew "hub"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "openexr", link: false
brew "ios-deploy"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "lf"
brew "libusbmuxd", args: ["HEAD"]
brew "lynx"
brew "minikube"
brew "mplayer"
brew "mysql"
brew "nano"
brew "neofetch"
brew "nmap"
brew "nsnake"
brew "opencv", link: false
brew "php"
brew "pick"
brew "pipes-sh"
brew "pkg-config"
brew "pyenv-virtualenvwrapper"
brew "python@2"
brew "ranger"
brew "ruby"
brew "screenfetch"
brew "sdl"
brew "speedtest-cli"
brew "task"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "toilet"
brew "travis"
brew "tree"
brew "ultralist"
brew "watch"
brew "wget"
brew "wtfutil"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "antoniott15/fgf/fgf"
brew "dart-lang/dart/dart"
cask "balenaetcher"
cask "cakebrew"
cask "cool-retro-term"
cask "discord"
cask "iterm2"
cask "obs"
cask "opera"
cask "pock"
cask "postman"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "windows95"
cask "zoomus"
cask "zwift"
