74th.monokai-charcoal-high-contrast
aaron-bond.better-comments
abusaidm.html-snippets
adamgraham.polykai-theme
aleksandra.go-group-imports
alex-shnayder.theme-raspberry
cameronbieganek.julia-color-themes
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer-2
cschleiden.vscode-github-actions
Dart-Code.dart-code
Dart-Code.flutter
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eg2.vscode-npm-script
esbenp.prettier-vscode
exiasr.hadolint
foam.foam-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
formulahendry.github-actions
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
gmlewis-vscode.flutter-stylizer
golang.go
GulajavaMinistudio.mayukaithemevsc
hediet.vscode-drawio
icrawl.discord-vscode
ipedrazas.kubernetes-snippets
James-Yu.latex-workshop
jameslan.yaclock
jasontheiler.kelp-forest-theme-vscode
jdinhlife.gruvbox
JeffersonQin.latex-snippets-jeff
jeroen-meijer.pubspec-assist
KevinRose.vsc-python-indent
kiteco.kite
leveluptutorials.theme-levelup
markfknight.monokai-operator-theme
MartinLaRegina.clear-view-indent
monokai.theme-monokai-pro-vscode
mquandalle.graphql
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
msjsdiag.debugger-for-chrome
Nash.awesome-flutter-snippets
naumovs.color-highlight
njpwerner.autodocstring
npxms.hide-gitignored
philsinatra.popping-and-locking-vscode-black
phr0s.bib
pnp.polacode
redhat.java
redhat.vscode-yaml
ritwickdey.LiveServer
sharat.vscode-brewfile
shardulm94.trailing-spaces
skyran.js-jsx-snippets
spywhere.now-playing
streetsidesoftware.code-spell-checker
teabyii.ayu
tecosaur.latex-utilities
thomanq.math-snippets
tomphilbin.gruvbox-themes
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
Vtrois.gitmoji-vscode
WakaTime.vscode-wakatime
windmilleng.vscode-go-autotest
znck.grammarly
