tap "felixkratz/formulae"
tap "gleich/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "minio/stable"
tap "zegervdv/zathura"
# MPEG-4 command-line tool
brew "atomicparsley"
# Python code formatter
brew "black"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Statistics utility to count lines of code
brew "cloc"
# .NET Core
brew "dotnet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20"
# Package for scientific computing with Python
brew "numpy"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Software for mathematics, science, and engineering
brew "scipy"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# MIPS32 simulator
brew "spim"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer", args: ["HEAD"]
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Markup-based typesetting system
brew "typst"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Update the copyright year in all of your GitHub repos 
brew "gleich/tap/new_yearify"
brew "gleich/tap/solar"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# PDF viewer
brew "zegervdv/zathura/zathura"
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# GPU-accelerated terminal emulator
cask "alacritty"
# Menu bar icon organiser
cask "bartender"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox@developer-edition"
cask "font-geist-mono"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-proggy-clean-tt-nerd-font"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Grammarly for desktop
cask "grammarly-desktop"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Music services manager
cask "lastfm"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Converts and edits video, audio or image files
cask "permute"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adamgraham.polykai-theme"
vscode "akamud.vscode-theme-onedark"
vscode "angular.ng-template"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "blanu.vscode-styled-jsx"
vscode "bmalehorn.vscode-fish"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "divlo.vscode-styled-jsx-languageserver"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jeffersonqin.latex-snippets-jeff"
vscode "jock.svg"
vscode "kdarkhan.mips"
vscode "mattgleich.theme-blackbird"
vscode "meganrogge.template-string-converter"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "openai.openai-chatgpt-adhoc"
vscode "pmndrs.pmndrs"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "skyran.js-jsx-snippets"
vscode "spywhere.now-playing"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
vscode "znck.grammarly"
