tap "bcongdon/ep"
tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "flschweiger/flutter"
tap "github/gh"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "matt-gleich/taps"
tap "morse-module/morse-module"
tap "nektos/tap"
tap "octo-cli/octo"
tap "puppetlabs/puppet"
tap "rodionovd/taps"
tap "romkatv/powerlevel10k"
tap "sambadevi/powerlevel9k"
cask "xquartz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Automate deployment, configuration, and upgrading
brew "ansible"
# C++ template library for linear algebra
brew "eigen"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Library for manipulating PNG images
brew "libpng"
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Platform built on V8 to build network applications
brew "node"
# Gatsby command-line interface
brew "gatsby-cli"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# GitHub-like contributions calendar but on the command-line
brew "git-cal"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Google Search and News from the command-line
brew "googler"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Version Control Visualization Tool
brew "gource"
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# High dynamic-range image file format
brew "openexr"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LastPass command-line interface tool
brew "lastpass-cli"
# Terminal file manager
brew "lf"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# UNIX movie player
brew "mplayer"
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Classic snake game with textual interface
brew "nsnake"
# Manage multiple Node.js versions
brew "nvm"
# High-level interpreted language for numerical computing
brew "octave"
# Open source computer vision library
brew "opencv"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# General-purpose scripting language
brew "php"
# Utility to choose one option from a set of choices
brew "pick"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Python package management tool
brew "poetry"
# Show ps output as a tree
brew "pstree"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# File browser
brew "ranger"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Programatically correct mistyped console commands
brew "thefuck"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Simple GTD-style task management for the command-line
brew "ultralist"
# Terminal-based Tetris clone
brew "vitetris"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# UNIX/Linux command-line tool to interact with an EWMH/NetWM
brew "wmctrl"
# The personal information dashboard for your terminal
brew "wtfutil"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# The Dungeon modified from FORTRAN to C
brew "zork"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ⛏ A CLI Emoji Picker
brew "bcongdon/ep/ep"
# The Dart SDK
brew "dart-lang/dart/dart"
# GitHub CLI
brew "github/gh/gh"
# ☢️ Force quit all applications with one terminal command
brew "matt-gleich/taps/nuke"
# Separate your pdfs from your tex files
brew "matt-gleich/taps/texsep"
# Run GitHub Actions locally
brew "nektos/tap/act"
# cli client for GitHub
brew "octo-cli/octo/octo"
# CLI manager for your text replacements on macOS
brew "rodionovd/taps/shortcuts"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
cask "adobe-creative-cloud"
cask "alacritty"
cask "alfred"
cask "atom"
cask "balenaetcher"
cask "brave-browser"
cask "chromedriver"
cask "cool-retro-term"
cask "discord"
cask "docker"
cask "dockey"
cask "dozer"
cask "drawio"
cask "figma"
cask "flutter"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-metropolis"
cask "g-desktop-suite"
cask "geotag-photos-pro"
cask "github"
cask "gitify"
cask "google-chrome"
cask "grammarly"
cask "hazeover"
cask "hyper"
cask "icons8"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kite"
cask "lens"
cask "logitech-options"
cask "macs-fan-control"
cask "michaelvillar-timer"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "minecraft"
cask "notion"
cask "obinslab-starter"
cask "opera"
cask "pdk"
cask "pock"
cask "postman"
cask "rocket"
cask "sdformatter"
cask "shortcuts"
cask "telegram"
cask "vagrant"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "webex-meetings"
cask "windows95"
cask "zoomus"
cask "zwift"
mas "1Focus", id: 969210610
mas "Affinity Photo", id: 824183456
mas "Battery Monitor", id: 836505650
mas "Battery Stats for AirPods", id: 1405763798
mas "CleanMyDrive 2", id: 523620159
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Downlink", id: 1454269192
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Encrypto", id: 935235287
mas "Filters for Photos", id: 1083965373
mas "Firewatch", id: 1164603847
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "GitGrass", id: 1501139279
mas "Grammarly for Safari", id: 1462114288
mas "HEIC Converter", id: 1294126402
mas "iBooks Author", id: 490152466
mas "iMovie", id: 408981434
mas "IPYNB Viewer", id: 1400977081
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "Mini Metro", id: 1047760200
mas "Numbers", id: 409203825
mas "Octagon", id: 691956219
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "RAW Power", id: 1157116444
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Sleep Alarm Clock", id: 1091149644
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Surviving Mars", id: 1384295904
mas "Termius", id: 1176074088
mas "Transporter", id: 1450874784
mas "Trello", id: 1278508951
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
