tap "antoniott15/fgf"
tap "dart-lang/dart"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "sambadevi/powerlevel9k"
cask "xquartz"
brew "ansible"
brew "bash-completion"
brew "libpng"
brew "python"
brew "cask"
brew "cmake"
brew "eigen"
brew "cmatrix"
brew "cowsay"
brew "dive"
brew "docker", link: false
brew "docker-compose", link: false
brew "exiftool"
brew "jpeg"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "fish"
brew "fortune"
brew "ghi"
brew "git", link: false
brew "gnupg", link: false
brew "go"
brew "googler"
brew "gource"
brew "htop"
brew "hub"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "openexr", link: false
brew "ios-deploy"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "lf"
brew "libusbmuxd", args: ["HEAD"]
brew "lynx"
brew "mas"
brew "minikube"
brew "mplayer"
brew "mysql"
brew "nano"
brew "neofetch"
brew "nmap"
brew "nsnake"
brew "php"
brew "pick"
brew "pipes-sh"
brew "pkg-config"
brew "pyenv-virtualenvwrapper"
brew "python@2"
brew "ranger"
brew "ruby"
brew "screenfetch"
brew "sdl"
brew "sl"
brew "speedtest-cli"
brew "task"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "toilet"
brew "travis"
brew "tree"
brew "ultralist"
brew "watch"
brew "wget"
brew "wtfutil"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "antoniott15/fgf/fgf"
brew "dart-lang/dart/dart"
cask "balenaetcher"
cask "brave-browser"
cask "cakebrew"
cask "cinebench"
cask "cool-retro-term"
cask "discord"
cask "docker"
cask "dockey"
cask "figma"
cask "geekbench"
cask "geotag-photos-pro"
cask "google-backup-and-sync"
cask "google-earth-pro"
cask "grammarly"
cask "hyper"
cask "iterm2"
cask "obs"
cask "opera"
cask "pock"
cask "postman"
cask "sdformatter"
cask "vagrant"
cask "visual-studio-code"
cask "webex-meetings"
cask "windows95"
cask "zoomus"
cask "zwift"
mas "1Focus", id: 969210610
mas "Asphalt 9", id: 1491129197
mas "Battery Monitor", id: 836505650
mas "Break", id: 1273243144
mas "CleanMyDrive 2", id: 523620159
mas "ColorSlurp", id: 1287239339
mas "com.donewithcomputers.winston", id: 1161123070
mas "Countdowns", id: 926707738
mas "Day One", id: 1055511498
mas "Disk Speed Test", id: 425264550
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Encrypto", id: 935235287
mas "Filters for Photos", id: 1083965373
mas "Firewatch", id: 1164603847
mas "GarageBand", id: 682658836
mas "HEIC Converter", id: 1294126402
mas "Helium", id: 1054607607
mas "Hype 4", id: 1460330618
mas "iBooks Author", id: 490152466
mas "iMovie", id: 408981434
mas "IPYNB Viewer", id: 1400977081
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Markoff", id: 1084713122
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mini Metro", id: 1047760200
mas "myHomework", id: 970610831
mas "Numbers", id: 409203825
mas "Octagon", id: 691956219
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "RAW Power", id: 1157116444
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Sleep Alarm Clock", id: 1091149644
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Surviving Mars", id: 1384295904
mas "Termius", id: 1176074088
mas "Transporter", id: 1450874784
mas "Trello", id: 1278508951
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
