tap "alexellis/alexellis"
tap "dart-lang/dart"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "matt-gleich/taps"
tap "nektos/tap"
tap "rodionovd/taps"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Platform built on V8 to build network applications
brew "node"
# Unfancy JavaScript
brew "coffeescript"
# Configurable talking characters in ASCII art
brew "cowsay"
# Modern replacement for 'ls'
brew "exa"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Emoji guide for your commit messages
brew "gitmoji"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generic library support script
brew "libtool"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Version Control Visualization Tool
brew "gource"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line note taker
brew "jrnl"
# Mac App Store command-line interface
brew "mas"
# Text-based UI library
brew "ncurses"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Python package management tool
brew "poetry"
# Cross-platform library for audio I/O
brew "portaudio"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Show ps output as a tree
brew "pstree"
# File browser
brew "ranger"
# Command-line time tracking application
brew "timewarrior"
# Digital clock in ncurses
brew "tty-clock"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# Install k3s over SSH with ('ketchup')
brew "alexellis/alexellis/k3sup"
# The Dart SDK
brew "dart-lang/dart/dart"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# ☢️ Force quit all applications with one terminal command
brew "matt-gleich/taps/nuke"
# Run GitHub Actions locally
brew "nektos/tap/act"
# CLI manager for your text replacements on macOS
brew "rodionovd/taps/shortcuts"
cask "adobe-creative-cloud"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "background-music"
cask "bartender"
cask "brave-browser"
cask "cheatsheet"
cask "cool-retro-term"
cask "discord"
cask "docker"
cask "drawio"
cask "edex-ui"
cask "figma"
cask "font-3270"
cask "font-fira-code"
cask "github"
cask "gitify"
cask "gitkraken"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "grammarly"
cask "hyper"
cask "iterm2"
cask "kite"
cask "kitty"
cask "logitech-options"
cask "mactex"
cask "notion"
cask "opera"
cask "phoenix"
cask "postman"
cask "ripcord"
cask "slack"
cask "steam"
cask "virtualbox"
cask "visual-studio-code"
cask "zoomus"
cask "zwift"
mas "2048 Game", id: 871033113
mas "Dark Reader for Safari", id: 1438243180
mas "Encrypto", id: 935235287
mas "Firewatch", id: 1164603847
mas "Gifski", id: 1351639930
mas "Git Streaks", id: 1525795950
mas "Grammarly for Safari", id: 1462114288
mas "HEIC Converter", id: 1294126402
mas "Helium", id: 1054607607
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Spark", id: 1176895641
mas "Surviving Mars", id: 1384295904
mas "Termius", id: 1176074088
mas "Todoist", id: 585829637
mas "WeatherBug", id: 1059074180
mas "Xcode", id: 497799835
