tap "alexanderwillner/tap"
tap "alexellis/alexellis"
tap "dart-lang/dart"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "matt-gleich/taps"
tap "moritzsternemann/apple-fonts"
tap "nektos/tap"
tap "orf/brew"
tap "rishiosaur/taps"
tap "rodionovd/taps"
tap "sourcegraph/src-cli"
tap "wfxr/code-minimap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Platform built on V8 to build network applications
brew "node"
# Unfancy JavaScript
brew "coffeescript"
# Configurable talking characters in ASCII art
brew "cowsay"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern replacement for 'ls'
brew "exa"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Emoji guide for your commit messages
brew "gitmoji"
# Generic library support script
brew "libtool"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Version Control Visualization Tool
brew "gource"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Command-line note taker
brew "jrnl"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python package management tool
brew "poetry"
# Cross-platform library for audio I/O
brew "portaudio"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Show ps output as a tree
brew "pstree"
# File browser
brew "ranger"
# Safe, concurrent, practical language
brew "rust"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Programatically correct mistyped console commands
brew "thefuck"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Digital clock in ncurses
brew "tty-clock"
# Source code beautifier
brew "uncrustify"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# Install k3s over SSH with ('ketchup')
brew "alexellis/alexellis/k3sup"
# The Dart SDK
brew "dart-lang/dart/dart"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# 📁 Automate the organization of your cloned GitHub repositories
brew "matt-gleich/taps/fgh"
# ☢️ Force quit all applications with one terminal command
brew "matt-gleich/taps/nuke"
# Run GitHub Actions locally
brew "nektos/tap/act"
# Ping, but with a graph.
brew "orf/brew/gping"
# A minimal interpreted language.
brew "rishiosaur/taps/sepia"
# CLI manager for your text replacements on macOS
brew "rodionovd/taps/shortcuts"
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli"
# A high performance code minimap generator written in rust
brew "wfxr/code-minimap/code-minimap"
cask "adobe-creative-cloud"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "background-music"
cask "balenaetcher"
cask "brave-browser"
cask "cheatsheet"
cask "cool-retro-term"
cask "discord"
cask "docker"
cask "drawio"
cask "edex-ui"
cask "figma"
cask "flutter"
cask "font-3270"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "github"
cask "gitify"
cask "gitkraken"
cask "gitup"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "grammarly"
cask "hyper"
cask "iterm2"
cask "kite"
cask "logitech-options"
cask "macs-fan-control"
cask "mactex"
cask "minecraft"
cask "ngrok"
cask "nova"
cask "obinskit"
cask "obsidian"
cask "opera"
cask "postman"
cask "raspberry-pi-imager"
cask "rectangle"
cask "ripcord"
cask "slack"
cask "steam"
cask "swimat"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomin"
cask "zoomus"
cask "zwift"
mas "1Focus", id: 969210610
mas "AdBlock Pro", id: 1018301773
mas "Boop", id: 1518425043
mas "ColorSlurp", id: 1287239339
mas "CopyClip", id: 595191960
mas "Dark Reader for Safari", id: 1438243180
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Encrypto", id: 935235287
mas "Firewatch", id: 1164603847
mas "Gifski", id: 1351639930
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "HEIC Converter", id: 1294126402
mas "Helium", id: 1054607607
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Poolside FM", id: 1514817810
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "Things", id: 904280696
mas "Twitter", id: 1482454543
mas "WeatherBug", id: 1059074180
mas "XCFormat", id: 1165321484
mas "Xcode", id: 497799835
