akamud.vscode-theme-onedark
angular.ng-template
antfu.icons-carbon
antfu.theme-vitesse
arthurwhite.white
beardedbear.beardedtheme
blanu.vscode-styled-jsx
bmalehorn.vscode-fish
bodil.prettier-toml
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
divlo.vscode-styled-jsx-languageserver
donjayamanne.githistory
dustypomerleau.rust-syntax
emeraldwalk.runonsave
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
icrawl.discord-vscode
james-yu.latex-workshop
jeffersonqin.latex-snippets-jeff
jock.svg
leetcode.vscode-leetcode
mattgleich.theme-blackbird
meganrogge.template-string-converter
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
naumovs.color-highlight
njpwerner.autodocstring
redhat.java
rust-lang.rust-analyzer
serayuzgur.crates
shardulm94.trailing-spaces
spywhere.now-playing
sswg.swift-lang
streetsidesoftware.code-spell-checker
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tecosaur.latex-utilities
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vivaxy.vscode-conventional-commits
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
xadillax.viml
yzhang.markdown-all-in-one
znck.grammarly
