Angular.ng-template
antfu.icons-carbon
antfu.theme-vitesse
arthurwhite.white
blanu.vscode-styled-jsx
bmalehorn.vscode-fish
bodil.prettier-toml
bungcip.better-toml
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
Divlo.vscode-styled-jsx-languageserver
donjayamanne.githistory
dustypomerleau.rust-syntax
emeraldwalk.RunOnSave
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
GitHub.github-vscode-theme
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
icrawl.discord-vscode
James-Yu.latex-workshop
JeffersonQin.latex-snippets-jeff
jock.svg
MattGleich.theme-blackbird
meganrogge.template-string-converter
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-python.black-formatter
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.remote-explorer
naumovs.color-highlight
njpwerner.autodocstring
redhat.java
rust-lang.rust-analyzer
serayuzgur.crates
shardulm94.trailing-spaces
spywhere.now-playing
streetsidesoftware.code-spell-checker
sumneko.lua
svelte.svelte-vscode
tauri-apps.tauri-vscode
tecosaur.latex-utilities
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vivaxy.vscode-conventional-commits
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
WakaTime.vscode-wakatime
XadillaX.viml
yzhang.markdown-all-in-one
znck.grammarly
