adamgraham.polykai-theme
akamud.vscode-theme-onedark
antfu.icons-carbon
antfu.theme-vitesse
blanu.vscode-styled-jsx
bmalehorn.vscode-fish
bodil.prettier-toml
christian-kohler.path-intellisense
clinyong.vscode-css-modules
dbaeumer.vscode-eslint
divlo.vscode-styled-jsx-languageserver
donjayamanne.githistory
dustypomerleau.rust-syntax
emeraldwalk.runonsave
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
garmin.monkey-c
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.terraform
icrawl.discord-vscode
james-yu.latex-workshop
jdinhlife.gruvbox
jeffersonqin.latex-snippets-jeff
jock.svg
mattgleich.theme-blackbird
meganrogge.template-string-converter
mgmcdermott.vscode-language-babel
mikestead.dotenv
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
naumovs.color-highlight
njpwerner.autodocstring
pmndrs.pmndrs
rust-lang.rust-analyzer
shardulm94.trailing-spaces
skyran.js-jsx-snippets
spywhere.now-playing
streetsidesoftware.code-spell-checker
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
tecosaur.latex-utilities
usernamehw.errorlens
vadimcn.vscode-lldb
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
vscodevim.vim
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
xadillax.viml
yzhang.markdown-all-in-one
zeshuaro.vscode-python-poetry
znck.grammarly
